#include <iostream>
#include "Menu.h"

/*
	Это будет моя программа по отслеживанию и статистике моих тренировок.
	Я хочу пользоваться ей каждый раз, когда занимаюсь физической активностью.
	Мне хочется делать этот проект не только для того, чтобы следить за прогрессом тренировок,
		но и для того, чтобы видеть и даже практиковаться создавать свой продукт так, как нужно,
		так, как положено; видеть создание приложений как настоящий архитектор.

	=== ЗАДАЧИ ===
	[ ] Создать простое меню
		[ ] Меню выводится на экран
		[ ] Меню проверяет ввод пользователя
		[ ] Меню сообщает об ошибке и просит ввести данные снова
		[ ] С помощью меню можно полностью выйти из приложения
*/

int main()
{




	MenuItem item{"Hello", 4};





	// Сначала будет простенькое, но хорошее меню для пользователя

	// Далее пользователь может выбрать необходимый пункт меню
	
	// В случае ошибки меню предложит выбрать пункт заново

	std::cin.get();
	return 0;
}